# RoutingCriterionBase Class

---
RoutingCriteriaBase is the base class for all routing criteria.
SystemObject Autodesk.Revit.DBRoutingCriterionBase Autodesk.Revit.DBPrimarySizeCriterion
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RoutingCriterionBase : IDisposable

    Public Class RoutingCriterionBase
    	Implements IDisposable

    public ref class RoutingCriterionBase : IDisposable

    type RoutingCriterionBase =
        class
            interface IDisposable
        end
The RoutingCriterionBase type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the RoutingCriterionBase
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsEqual|  Verify if two criteria are the same.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace